info = "Выбери тему и вид обучения для подготовки." \
       "\n\n*Тесты:* пиши правильные варианты ответа цифрами без пробелов и дополнительных символов. Вариантов может быть несколько." \
       "\n\n*Кейсы:* пиши правильные ответы в соответствии с требованиями вопросов. " \
       "\n\nДля того, чтобы ответить на вопрос:" \
       "\n1. Напиши ответ." \
       "\n2. Нажми «Отправить», если уверен в предоставленных вариантах." \
       "\n\nЕсли во время прохождения теста ты перейдешь в меню, то результат сбросится, помни об этом!"

no_access = "У тебя нет прав на использования данного бота!\n\n" \
           "Отправь @lexxxekb ссылку своей страницы на Стаффе и этот телеграмм ID: "