info = "Выбери тему и вид обучения для подготовки." \
       "\n\n*Тесты:* пиши правильные варианты ответа цифрами без пробелов и дополнительных символов. Вариантов может быть несколько." \
       "\n\n*Кейсы:* пиши правильные ответы в соответствии с требованиями вопросов. " \
       "\n\nДля того, чтобы ответить на вопрос:" \
       "\n1. Напиши ответ." \
       "\n2. Нажми «Отправить», если уверен в предоставленных вариантах." \
       "\n\nЕсли во время прохождения теста ты перейдешь в меню, то результат сбросится, помни об этом!"

no_access = "У тебя нет прав на использования данного бота!\n\n" \
           "Отправь @lexxxekb ссылку своей страницы на Стаффе и этот телеграмм ID: "

no_access_test_mode = "Привет. Это тестовая версия бота @OOHelperBot.\n" \
                     "Если твой телеграмм указан на Стаффе, нажми /start для авторегистрации. " \
                     "Страница должна быть создана или отредактирована в течение 5 последних дней. \n\n" \
                     "Нажмай /start не более 5 раз с промежутком примерно в 5 секунд. " \
                     "Если ты отправишь команду больше или чаще, то ничего не поменяется, " \
                     "просто если доступ не появился, то он уже и не повится. \n\n" \
                     "Если такое произошло, отправь @ivashev_right ссылку своей страницы на Стаффе и этот телеграмм ID: "

no_rights = 'У тебя недостаточно прав, чтобы воспользоваться ботом.'

admin_mes = 'Привет! Если ты видишь это сообщение, то у тебя чуть больше прав чем у других))\n' \
              'Выбирай необходимое действие.'

hello_mes = "Привет :) Это бот Отдела Обучения.\n" "Выбери нужную тему с помощью кнопок внизу."

education_type = "Какой вид обучения тебя интересует?"

no_admin_access = 'У тебя нет доступа к данному функционалу.'

waiting_check = "Проверяем ответ.\nПодожди немного."

not_selected = "Ты ещё не выбрал тему для прохождения тестов."

wait = 'Подготавливаю вопросы, это займёт некоторое время.'

instruction = '\n\nПиши правильные варианты ответа цифрами без дополнительных символов и пробелов. \n' \
                            'Помни! Вариантов ответов может быть несколько.'

tech_error_msg = 'Спасибо! Информация передана ответственному.\nЕсли понадобится уточнение он с тобой свяжется.'\
                                          '\nДля продолжения ответь на последний вопрос.'

empty_answer = "Ты вводишь пустой ответ. Пока не напишешь варианты ответа, дальше не двинемся."

error_choice = 'Выбери направление о какой ошибке хочешь сообщить?'

test_1 = "Даты обновления информации: \nЭкстерн - 12.04.2023\nДиадок - 19.03.2023\nФокус - 01.03.2023\n \
Прочие продукты обновялись в 2020-2022 годах."

sending_base = f"Выбери действие над базой сообщений. \nОбщее число записей в базе: "

sending_calendar = f"Выбери действие над календарем рассылки. \nОбщее число не пустых записей в базе: "

send_actions = "Ты находишься в меню рассылок. Здесь можно просматривать и изменять сообщения," \
                 " а так же настраивать график их отправки. Время отправки стандартное: 12:05:05 ЕКБ.\n\n" \
                f"*База сообщений* - создание, изменение, просмотр общего списка.\n"\
                f"*Кадендарь рассылок* - Добавление, изменение, очистка дня для рассылки.\n"\
                f"*Начать новый набор* - сообщить боту, что начался новый набор."

add_new_message_base = 'Отправь боту текст рассылки, после чего нажми "Разместить рассылку".'
