info = "Выбери тему и вид обучения для подготовки." \
       "\n\n*Тесты:* пиши правильные варианты ответа цифрами без пробелов и дополнительных символов. Вариантов может быть несколько." \
       "\n\n*Кейсы:* пиши правильные ответы в соответствии с требованиями вопросов. " \
       "\n\nДля того, чтобы ответить на вопрос:" \
       "\n1. Напиши ответ." \
       "\n2. Нажми «Отправить», если уверен в предоставленных вариантах." \
       "\n\nЕсли во время прохождения теста ты перейдешь в меню, то результат сбросится, помни об этом!"

no_access = "У тебя нет прав на использования данного бота!\n\n" \
           "Отправь @lexxxekb ссылку своей страницы на Стаффе и этот телеграмм ID: "

no_rights = 'У тебя недостаточно прав, чтобы воспользоваться ботом.'

admin_mes = 'Привет! Если ты видишь это сообщение, то у тебя чуть больше прав чем у других))\n' \
                                           'Выбирай необходимое действие.'

hello_mes = "Привет :) Это бот Отдела Обучения.\n" "Выбери нужную тему с помощью кнопок внизу."

education_type = "Какой вид обучения тебя интересует?"

no_admin_access = 'У тебя нет доступа к данному функционалу.'

waiting_check = "Проверяем ответ.\nПодожди немного."

not_selected = "Ты ещё не выбрал тему для прохождения тестов."

wait = 'Подготавливаю вопросы, это займёт некоторое время.'

instruction = '\n\nПиши правильные варианты ответа цифрами без дополнительных символов и пробелов. \n' \
                            'Помни! Вариантов ответов может быть несколько.\n' \
                            'Если уверен в правильности ответа → Нажми «Отправить».'

tech_error_msg = 'Спасибо! Информация передана ответственному.\nЕсли понадобится уточнение он с тобой свяжется.'\
                                          '\nДля продолжения ответь на последний вопрос.'

empty_answer = "Ты вводишь пустой ответ. Пока не напишешь варианты ответа, дальше не двинемся."

error_choice = 'Выбери направление о какой ошибке хочешь сообщить?'

test_1 = "Это раздел для тестирования новых функций, пока здесь ничего нет."

sending_base = "Выбери действие над базой сообщений"

sending_calendar = "Выбери действие над календарем рассылки"
